<template>
  <ScrollPanel>
    <div>Многопользовательская карточная игра с большим внеигровым функционалом</div>
    <br>
    <Button
      label="Открыть"
      as="a"
      href="https://durak.ru"
      target="_blank"
      raised
    />
    <Divider />
    <div>Проект коммерческий, поэтому код не могу выложить в общий доступ.</div>
    <br>
    <div>Стек: Vue3 + Typescript + Vite + Nuxt + Pinia</div>
    <br>
    <Image
      src="/assets/duraklobby.png"
      class="modal__image"
      width="100%"
      alt="Игровое лобби"
      preview
    />
    <br>
    <br>
    <div>Казалось бы, что проект небольшой и с точки зрения разработки не очень интересный, но это оказалось совсем не так. За год у меня получилось неплохо вырасти, ведь была возможность работать с современными технологиями, углубиться именно во фронтенд и прикоснуться к 3д разработке с three.js.</div>
    <br>
    <div>За год в команде web-версии дурака я успела:</div>
    <ul>
      <li>Оптимизировать скорость загрузки первого экрана и коллекций, поправив запросы к апи</li>
      <li>Отрефакторить и оптимизировать работу со звуками и их загрузку</li>
      <li>Переработать работу с svg иконками во всем приложении</li>
      <li>Переписать и оптимизировать некоторые объемные анимации</li>
      <li>Реализовали в паре с коллегой функционал турниров</li>
      <li>Реализовала приглашение друзей из соц. сетей</li>
      <li>В админ панели создала редактор юридических документов, чтобы команда могла редактировать их без участия разработчиков</li>
    </ul>
  </ScrollPanel>
</template>

<script lang="ts" setup>
import ScrollPanel from 'primevue/scrollpanel';
import {Button, Divider, Image} from 'primevue';
</script>

<style scoped>
.modal__image {
  width: 50%;
}
</style>
