<template>
  <ScrollPanel>
    <div>Редактор состояний приложения для создания стейт машины</div>
    <br>
    <Divider />
    <div>Это коммерческий проект для внутреннего использования, поэтому его нет в открытом доступе.</div>
    <br>
    <div>Стек: React18 + Typescript + Zustand + RadixUI + React Flow</div>
    <br>
    <Image
      src="/assets/ssmeditor.webp"
      class="modal__image"
      width="100%"
      alt="Игровое лобби"
      preview
    />
    <br>
    <br>
    <div>Этот проект мы разрабатывали в команде Дурака Онлайн для удобного управления состояниями игры, чтобы их наглядно видел и мог менять даже геймдизайнер.</div>
    <div>Для меня это был первый опыт коммерческой разработки на реакте. Занималась я проектом недолго, но успела:</div>
    <ul>
      <li>Добавить систему тегов - создание, редактирование, применение к стейтам, добавление на канвас чтобы создать связи от тега</li>
      <li>Добавить возможность менять положение стрелок и триггеров на канвасе</li>
      <li>Добавить возможность переместить уже созданную связь к другому стейту</li>
      <li>Ряд мелких улучшений, например доп точки для связей, визуальные улучшения, фокус только что созданного стейта и т.д.</li>
    </ul>
    <div>Созданную карту состояний приложения можно экспортировать в json формате и использовать в коде клиента.</div>
  </ScrollPanel>
</template>

<script lang="ts" setup>
import ScrollPanel from 'primevue/scrollpanel';
import {Divider, Image} from 'primevue';
</script>

<style scoped>
.modal__image {
  width: 50%;
}
</style>
