<template>
  <ScrollPanel>
    <div>Самый удобный конструктор сайтов в России!</div>
    <br>
    <Button
      label="Открыть"
      as="a"
      href="https://lpmotor.ru"
      target="_blank"
      raised
    />
    <Divider />
    <div>Проект коммерческий, поэтому код не могу выложить в общий доступ. Но сам конструктор доступен после регистрации без оплаты.</div>
    <br>
    <div>Стек: Vue2 + Javascript + Jquery + Php + Mysql</div>
    <br>
    <Image
      src="/assets/lpmotoradmin.png"
      class="modal__image"
      width="100%"
      alt="Личный кабинет в конструкторе"
      preview
    />
    <br>
    <br>
    <div>Функции в конструкторе, которые я реализовала:</div>
    <ul>
      <li>Квиз-формы и их визуальный редактор с ветвлением</li>
      <li>Интеграция с фотостоком Unsplash</li>
      <li>Каталог товаров для сайта с фильтрацией и поиском</li>
      <li>Личный кабинет покупателя на сайте</li>
      <li>Ряд функций в корзине, например режим работы магазина</li>
      <li>Папки страниц в личном кабинете</li>
      <li>Множество виджетов, например разные виды меню, якори, корзина товаров, соц. сети, кнопка наверх и т.д.</li>
    </ul>
    <div>До перехода в команду разработки в этой же компании была ведущим специалистом службы поддержки, помогала решать проблемы пользователей и организовывала работу команды. Этот опыт был невероятно ценным для работы в любой продуктовой компании.</div>
    <div>Из заметных достижений, не касающихся общения с пользователями - создала первую версию сайта саппорта и совместно с коллегами из carrot quest написали <a href="https://www.carrotquest.io/blog/case-mottor/">статью о процессах</a>.</div>
  </ScrollPanel>
</template>

<script lang="ts" setup>
import ScrollPanel from 'primevue/scrollpanel';
import {Button, Divider, Image} from 'primevue';
</script>

<style scoped>
.modal__image {
  width: 50%;
}
</style>
