<template>
  <ScrollPanel>
    <div>Самый удобный конструктор сайтов в России!</div>
    <br>
    <Button
      label="Открыть"
      as="a"
      href="https://lpmotor.ru"
      target="_blank"
      raised
    />
    <Divider />
    <div>Проект коммерческий, поэтому код невозможно выложить в общий доступ. Но сам конструктор доступен после регистрации без оплаты, можно "пощупать" его с точки зрения пользователя.</div>
    <br>
    <div>Функции в конструкторе, которые я реализовала самостоятельно:</div>
    <ul>
      <li>Квиз-формы и их визуальный редактор с ветвлением</li>
      <li>Интеграция с фотостоком Unsplash</li>
      <li>Каталог товаров для сайта с фильтрацией и поиском</li>
      <li>Личный кабинет покупателя на сайте</li>
      <li>Папки страниц</li>
      <li>Множество виджетов, например разные виды меню, якори, корзина товаров, соц. сети, кнопка наверх и т.д.</li>
    </ul>
    <div>До перехода в команду разработки я была руководителем службы поддержки и поэтому хорошо знала клиентов сервиса. Многие функции и улучшения в конструтор были добавлены по моему предложению, конечно для этого пришлось много общаться и аргументировать свои идеи, чтобы их взяли в работу. В основном и реализацией этих идей я занималась сама, либо с кем-то в паре. В результате обычно мы получали и довольных клиентов и довольных операторов сдужбы поддержки, ведь им больше не приходилось отвечать что какой то важной функции не хватает :)</div>
    <div>Mottor Script</div>
    <div>...</div>
  </ScrollPanel>
</template>

<script lang="ts" setup>
import ScrollPanel from 'primevue/scrollpanel';
import {Button, Divider} from 'primevue';
</script>

<style scoped></style>
